turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cm/atdf/ATSAM4CMP8C_0.atdf
        <register caption="Transfer Control Register" name="SPI_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="SPI_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="SPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x535049"/>
      </value-group>
    </module>
    <module caption="Supply Controller" name="SUPC" version="11249B">
      <register-group name="SUPC">
        <register caption="Supply Controller Control Register" name="SUPC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Voltage Regulator Off" mask="0x00000004" name="VROFF" values="SUPC_CR__VROFF"/>
          <bitfield caption="Crystal Oscillator Select" mask="0x00000008" name="XTALSEL" values="SUPC_CR__XTALSEL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="SUPC_CR__KEY"/>
        </register>
        <register caption="Supply Controller Supply Monitor Mode Register" name="SUPC_SMMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Supply Monitor Threshold" mask="0x0000000F" name="SMTH"/>
          <bitfield caption="Supply Monitor Sampling Period" mask="0x00000700" name="SMSMPL" values="SUPC_SMMR__SMSMPL"/>
          <bitfield caption="Supply Monitor Reset Enable" mask="0x00001000" name="SMRSTEN" values="SUPC_SMMR__SMRSTEN"/>
          <bitfield caption="Supply Monitor Interrupt Enable" mask="0x00002000" name="SMIEN" values="SUPC_SMMR__SMIEN"/>
        </register>
        <register caption="Supply Controller Mode Register" name="SUPC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="LCD Voltage Regulator Output" mask="0x0000000F" name="LCDVROUT"/>
          <bitfield caption="LCD Controller Mode of Operation" mask="0x00000030" name="LCDMODE" values="SUPC_MR__LCDMODE"/>
          <bitfield caption="Brownout Detector Reset Enable" mask="0x00001000" name="BODRSTEN" values="SUPC_MR__BODRSTEN"/>
          <bitfield caption="Brownout Detector Disable" mask="0x00002000" name="BODDIS" values="SUPC_MR__BODDIS"/>
          <bitfield caption="Voltage Regulator enable" mask="0x00004000" name="ONREG" values="SUPC_MR__ONREG"/>
          <bitfield caption="Backup Area Power-On Reset Enable" mask="0x00008000" name="BUPPOREN" values="SUPC_MR__BUPPOREN"/>
          <bitfield caption="Oscillator Bypass" mask="0x00100000" name="OSCBYPASS" values="SUPC_MR__OSCBYPASS"/>
          <bitfield caption="Password Key" mask="0xFF000000" name="KEY" values="SUPC_MR__KEY"/>
        </register>
